In [1]:
import pandas as pd
from selenium import webdriver
import time
import warnings
from selenium.webdriver.common.by import By
from selenium.webdriver.chrome.options import Options
from webdriver_manager.chrome import ChromeDriverManager

In [2]:
url= 'https://www.vertebradosibericos.org/aves/habitat/bubbubha.html'

In [3]:
PATH = 'driver/ChromeDriver.exe'

driver = webdriver.Chrome()  

driver.get(url)
driver

In [4]:
tabla = driver.find_element(By.CSS_SELECTOR, 'body > div > div > table > tbody > tr:nth-child(3) > td:nth-child(2) > table:nth-child(30)')

tabla

In [5]:
cuerpo = tabla.find_element(By.TAG_NAME, 'tbody')
filas = cuerpo.find_elements(By.TAG_NAME, 'tr')

In [6]:
matriz = []


for f in filas:
    
    tmp = []
    
    elems = f.find_elements(By.TAG_NAME, 'td')  # esto es una lista
    
    for e in elems:
        
        tmp.append(e.text)
        
    matriz.append(tmp)

In [7]:
df = pd.DataFrame(matriz)
df

      0        1                                        2
0   Año  Parejas                               Referencia
1  1997      560                         (Purroy, 1997) *
2  2003    2.400  (Martínez-Climent y Zuberogoitia, 2003)

In [8]:
columnas_nuevas=('year','parejas','columna a eliminar')

In [9]:
df.columns= columnas_nuevas

In [10]:
df

   year  parejas                       columna a eliminar
0   Año  Parejas                               Referencia
1  1997      560                         (Purroy, 1997) *
2  2003    2.400  (Martínez-Climent y Zuberogoitia, 2003)

In [11]:
df = df.drop('columna a eliminar', axis=1)

In [12]:
df

   year  parejas
0   Año  Parejas
1  1997      560
2  2003    2.400

In [13]:
df = df.drop(0)

In [14]:
df

   year parejas
1  1997     560
2  2003   2.400

In [15]:
df.at[2, 'parejas'] = df.at[2, 'parejas'].replace('.', '')

In [16]:
df['parejas'] = pd.to_numeric(df['parejas'], errors='coerce')

In [17]:
df['total_de_buhos'] = df['parejas'] * 2

In [18]:
df

   year  parejas  total_de_buhos
1  1997      560            1120
2  2003     2400            4800

In [19]:
df['Especie_buh'] = 'Buho real'

In [20]:
df

   year  parejas  total_de_buhos Especie_buh
1  1997      560            1120   Buho real
2  2003     2400            4800   Buho real

In [21]:
column_order = ['year','parejas','total_de_buhos','Especie_buh']
df = df[column_order]

In [22]:
df

   year  parejas  total_de_buhos Especie_buh
1  1997      560            1120   Buho real
2  2003     2400            4800   Buho real

In [25]:
df['year'] = pd.to_numeric(df['year'], errors='coerce')

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 1 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            2 non-null      int64
 1   parejas         2 non-null      int64
 2   total_de_buhos  2 non-null      int64
 3   Especie_buh     2 non-null      object
dtypes: int64(3), object(1)
memory usage: 196.0+ bytes

In [27]:
df

   year  parejas  total_de_buhos Especie_buh
1  1997      560            1120   Buho real
2  2003     2400            4800   Buho real

In [28]:
#df.to_csv('Buhos_real_España.csv', index=False)